PinguinoIDE/pinguino-compilers/windows32/p8/share/gputils/header/p16f18875.inc
;----- IOCEF Bits -----------------------------------------------------
IOCEF3           EQU  H'0003'


;----- CCDNE Bits -----------------------------------------------------
CCDNE0           EQU  H'0000'
CCDNE1           EQU  H'0001'
CCDNE2           EQU  H'0002'


;----- CCDPE Bits -----------------------------------------------------
CCDPE0           EQU  H'0000'
CCDPE1           EQU  H'0001'
CCDPE2           EQU  H'0002'


;----- STATUS_SHAD Bits -----------------------------------------------------
C_SHAD           EQU  H'0000'
DC_SHAD          EQU  H'0001'
Z_SHAD           EQU  H'0002'



;==========================================================================
;
;       RAM Definitions
;
;==========================================================================
       __MAXRAM  H'0FFF'
       __BADRAM  H'001B'
       __BADRAM  H'0092'
       __BADRAM  H'009F'
       __BADRAM  H'0118'
       __BADRAM  H'0193'
       __BADRAM  H'0194'
       __BADRAM  H'0195'
       __BADRAM  H'019D'
       __BADRAM  H'019E'
       __BADRAM  H'019F'
       __BADRAM  H'029E'
       __BADRAM  H'029F'
       __BADRAM  H'038F'
       __BADRAM  H'0393'
       __BADRAM  H'0394'
       __BADRAM  H'0395'
       __BADRAM  H'0396'
       __BADRAM  H'0397'
       __BADRAM  H'0398'
       __BADRAM  H'0399'
       __BADRAM  H'039A'
       __BADRAM  H'039B'
       __BADRAM  H'039C'
       __BADRAM  H'039D'
       __BADRAM  H'039E'
       __BADRAM  H'039F'
       __BADRAM  H'0412'
       __BADRAM  H'0413'
       __BADRAM  H'0414'
       __BADRAM  H'0415'
       __BADRAM  H'049E'
       __BADRAM  H'049F'
       __BADRAM  H'051E'
       __BADRAM  H'051F'
       __BADRAM  H'0594'
       __BADRAM  H'0595'
       __BADRAM  H'0596'
       __BADRAM  H'0597'
       __BADRAM  H'0598'
       __BADRAM  H'0599'
       __BADRAM  H'059A'
       __BADRAM  H'059B'
       __BADRAM  H'059C'
       __BADRAM  H'059D'
       __BADRAM  H'059E'
       __BADRAM  H'059F'
       __BADRAM  H'0615'
       __BADRAM  H'061F'
       __BADRAM  H'0650'-H'066F'
       __BADRAM  H'0695'
       __BADRAM  H'0696'
       __BADRAM  H'0697'
       __BADRAM  H'0698'
       __BADRAM  H'0699'
       __BADRAM  H'069A'
       __BADRAM  H'069B'
       __BADRAM  H'069C'
       __BADRAM  H'069D'
       __BADRAM  H'069E'
       __BADRAM  H'069F'
       __BADRAM  H'06A0'-H'06EF'
       __BADRAM  H'0715'
       __BADRAM  H'071F'
       __BADRAM  H'0720'-H'076F'
       __BADRAM  H'078C'-H'0795'
       __BADRAM  H'079C'
       __BADRAM  H'079D'
       __BADRAM  H'079E'
       __BADRAM  H'079F'
       __BADRAM  H'07A0'-H'07EF'
       __BADRAM  H'0815'-H'0819'
       __BADRAM  H'0820'-H'086F'
       __BADRAM  H'0894'
       __BADRAM  H'089C'-H'089F'
       __BADRAM  H'08A0'-H'08EF'
       __BADRAM  H'090D'
       __BADRAM  H'0910'-H'0913'
       __BADRAM  H'0914'-H'091E'
       __BADRAM  H'0920'-H'096F'
       __BADRAM  H'098C'-H'098E'
       __BADRAM  H'0998'-H'099F'
       __BADRAM  H'09A0'-H'09EF'
       __BADRAM  H'0A0C'-H'0A1F'
       __BADRAM  H'0A20'-H'0A6F'
       __BADRAM  H'0A8C'-H'0A9F'
       __BADRAM  H'0AA0'-H'0AEF'
       __BADRAM  H'0B0C'-H'0B1F'
       __BADRAM  H'0B20'-H'0B6F'
       __BADRAM  H'0B8C'-H'0B9F'
       __BADRAM  H'0BA0'-H'0BEF'
       __BADRAM  H'0C0C'-H'0C1F'
       __BADRAM  H'0C20'-H'0C6F'
       __BADRAM  H'0C8C'-H'0C9F'
       __BADRAM  H'0CA0'-H'0CEF'
       __BADRAM  H'0D0C'-H'0D1F'
       __BADRAM  H'0D20'-H'0D6F'
       __BADRAM  H'0D8C'-H'0D9F'
       __BADRAM  H'0DA0'-H'0DEF'
       __BADRAM  H'0E0C'-H'0E0E'
       __BADRAM  H'0E38'-H'0E6F'
       __BADRAM  H'0E8C'-H'0E8E'
       __BADRAM  H'0E98'-H'0E9B'
       __BADRAM  H'0E9F'-H'0EA0'
       __BADRAM  H'0EA6'-H'0EA8'
       __BADRAM  H'0EAD'-H'0EB0'
       __BADRAM  H'0EB4'-H'0EB7'
       __BADRAM  H'0EBF'-H'0EC2'
       __BADRAM  H'0EC4'
       __BADRAM  H'0ECD'-H'0ECF'
       __BADRAM  H'0ED0'-H'0EDF'
       __BADRAM  H'0EE0'-H'0EEF'
       __BADRAM  H'0F0C'-H'0F0F'
       __BADRAM  H'0F33'-H'0F37'
       __BADRAM  H'0F42'
       __BADRAM  H'0F4D'
       __BADRAM  H'0F58'
       __BADRAM  H'0F5E'-H'0F60'
       __BADRAM  H'0F63'
       __BADRAM  H'0F6E'-H'0F6F'
       __BADRAM  H'0F8C'-H'0F98'
       __BADRAM  H'0F99'-H'0F9C'
       __BADRAM  H'0F9D'-H'0F9F'
       __BADRAM  H'0FA0'-H'0FBF'
       __BADRAM  H'0FC0'-H'0FDF'
       __BADRAM  H'0FE0'-H'0FE2'
       __BADRAM  H'0FE3'
       __BADRAM  H'0FEC'

;==========================================================================
;
;       Configuration Bits
;
;   NAME            Address
;   CONFIG1           8007h
;   CONFIG2           8008h
;   CONFIG3           8009h
;   CONFIG4           800Ah
;   CONFIG5           800Bh
;
;==========================================================================

; The following is an assignment of address values for all of the
; configuration registers for the purpose of table reads
_CONFIG1         EQU  H'8007'
_CONFIG2         EQU  H'8008'
_CONFIG3         EQU  H'8009'
_CONFIG4         EQU  H'800A'
_CONFIG5         EQU  H'800B'

;----- CONFIG1 Options --------------------------------------------------
_FEXTOSC_LP      EQU  H'3FF8'    ; LP (crystal oscillator) optimized for 32.768kHz; PFM set to low power
_FEXTOSC_XT      EQU  H'3FF9'    ; XT (crystal oscillator) above 500kHz, below 4MHz; PFM set to medium power
_FEXTOSC_HS      EQU  H'3FFA'    ; HS (crystal oscillator) above 4MHz; PFM set to high power
_FEXTOSC_Reserved EQU  H'3FFB'    ; Reserved
_FEXTOSC_OFF     EQU  H'3FFC'    ; Oscillator not enabled
_FEXTOSC_ECL     EQU  H'3FFD'    ; EC below 500kHz; PFM set to low power
_FEXTOSC_ECM     EQU  H'3FFE'    ; EC for 500kHz to 8MHz; PFM set to medium power
_FEXTOSC_ECH     EQU  H'3FFF'    ; EC above 8MHz; PFM set to high power

_RSTOSC_Reserved EQU  H'3F8F'    ; Reserved
_RSTOSC_HFINTOSC_2PLL EQU  H'3F9F'    ; HFINTOSC with 2x PLL and HFFRQ=4'b1111
_RSTOSC_EXTOSC_4PLL EQU  H'3FAF'    ; EXTOSC with 4x PLL, with EXTOSC operating per FEXTOSC bits
_RSTOSC_EXTOSC_2PLL EQU  H'3FBF'    ; EXTOSC with 2x PLL, with EXTOSC operating per FEXTOSC bits
_RSTOSC_SOSC     EQU  H'3FCF'    ; SOSC
_RSTOSC_LFINTOSC EQU  H'3FDF'    ; LFINTOSC
_RSTOSC_HFINTOSC EQU  H'3FEF'    ; HFINTOSC with HFFRQ=4'b0000
_RSTOSC_EXTOSC   EQU  H'3FFF'    ; EXTOSC operating per FEXTOSC bits

