PinguinoIDE/pinguino-compilers/windows32/p8/share/gputils/header/p16f18875.inc
_CLKOUTENn_ON    EQU  H'3EFF'    ; CLKOUT function is enabled; FOSC/4 clock appears at OSC2
_CLKOUTENn_OFF   EQU  H'3FFF'    ; CLKOUT function is disabled; i/o or oscillator function on OSC2

_CSWEN_OFF       EQU  H'37FF'    ; The NOSC and NDIV bits cannot be changed by user software
_CSWEN_ON        EQU  H'3FFF'    ; Writing to NOSC and NDIV is allowed

_FCMEN_OFF       EQU  H'1FFF'    ; FSCM timer disabled
_FCMEN_ON        EQU  H'3FFF'    ; FSCM timer enabled

;----- CONFIG2 Options --------------------------------------------------
_MCLRE_ON        EQU  H'3FFE'    ; MCLR pin function is port defined function
_MCLRE_OFF       EQU  H'3FFF'    ; MCLR pin is Master Clear function

_PWRTEn_ON       EQU  H'3FFD'    ; PWRT enabled
_PWRTEn_OFF      EQU  H'3FFF'    ; PWRT disabled

_LPBOREN_ON      EQU  H'3FDF'    ; ULPBOR enabled
_LPBOREN_OFF     EQU  H'3FFF'    ; ULPBOR disabled

_BOREN_OFF       EQU  H'3F3F'    ; Brown-out reset disabled
_BOREN_SBOREN    EQU  H'3F7F'    ; Brown-out reset enabled according to SBOREN bit
_BOREN_NSLEEP    EQU  H'3FBF'    ; Brown-out Reset enabled while running, disabled in sleep; SBOREN is ignored
_BOREN_ON        EQU  H'3FFF'    ; Brown-out Reset Enabled, SBOREN bit is ignored

_BORV_HI         EQU  H'3DFF'    ; Brown-out Reset Voltage (VBOR) is set to 2.7V
_BORV_LO         EQU  H'3FFF'    ; Brown-out Reset Voltage (VBOR) set to 1.9V on LF, and 2.45V on F Devices

_ZCDDIS_OFF      EQU  H'3BFF'    ; Zero-cross detect circuit is always enabled
_ZCDDIS_ON       EQU  H'3FFF'    ; Zero-cross detect circuit is disabled at POR.

_PPS1WAY_OFF     EQU  H'37FF'    ; The PPSLOCK bit can be set and cleared repeatedly by software
_PPS1WAY_ON      EQU  H'3FFF'    ; The PPSLOCK bit can be cleared and set only once in software

_STVREN_OFF      EQU  H'2FFF'    ; Stack Overflow or Underflow will not cause a reset
_STVREN_ON       EQU  H'3FFF'    ; Stack Overflow or Underflow will cause a reset

;----- CONFIG3 Options --------------------------------------------------
_WDTCPS_WDTCPS_0 EQU  H'3FE0'    ; Divider ratio 1:32
_WDTCPS_WDTCPS_1 EQU  H'3FE1'    ; Divider ratio 1:64
_WDTCPS_WDTCPS_2 EQU  H'3FE2'    ; Divider ratio 1:128
_WDTCPS_WDTCPS_3 EQU  H'3FE3'    ; Divider ratio 1:256
_WDTCPS_WDTCPS_4 EQU  H'3FE4'    ; Divider ratio 1:512
_WDTCPS_WDTCPS_5 EQU  H'3FE5'    ; Divider ratio 1:1024
_WDTCPS_WDTCPS_6 EQU  H'3FE6'    ; Divider ratio 1:2048
_WDTCPS_WDTCPS_7 EQU  H'3FE7'    ; Divider ratio 1:4096
_WDTCPS_WDTCPS_8 EQU  H'3FE8'    ; Divider ratio 1:8192
_WDTCPS_WDTCPS_9 EQU  H'3FE9'    ; Divider ratio 1:16384
_WDTCPS_WDTCPS_10 EQU  H'3FEA'    ; Divider ratio 1:32768
_WDTCPS_WDTCPS_11 EQU  H'3FEB'    ; Divider ratio 1:65536
_WDTCPS_WDTCPS_12 EQU  H'3FEC'    ; Divider ratio 1:131072
_WDTCPS_WDTCPS_13 EQU  H'3FED'    ; Divider ratio 1:262144
_WDTCPS_WDTCPS_14 EQU  H'3FEE'    ; Divider ratio 1:524299
_WDTCPS_WDTCPS_15 EQU  H'3FEF'    ; Divider ratio 1:1048576
_WDTCPS_WDTCPS_16 EQU  H'3FF0'    ; Divider ratio 1:2097152
_WDTCPS_WDTCPS_17 EQU  H'3FF1'    ; Divider ratio 1:4194304
_WDTCPS_WDTCPS_18 EQU  H'3FF2'    ; Divider ratio 1:8388608
_WDTCPS_WDTCPS_19 EQU  H'3FF3'    ; Divider ratio 1:32
_WDTCPS_WDTCPS_20 EQU  H'3FF4'    ; Divider ratio 1:32
_WDTCPS_WDTCPS_21 EQU  H'3FF5'    ; Divider ratio 1:32
_WDTCPS_WDTCPS_22 EQU  H'3FF6'    ; Divider ratio 1:32
_WDTCPS_WDTCPS_23 EQU  H'3FF7'    ; Divider ratio 1:32
_WDTCPS_WDTCPS_24 EQU  H'3FF8'    ; Divider ratio 1:32
_WDTCPS_WDTCPS_25 EQU  H'3FF9'    ; Divider ratio 1:32
_WDTCPS_WDTCPS_26 EQU  H'3FFA'    ; Divider ratio 1:32
_WDTCPS_WDTCPS_27 EQU  H'3FFB'    ; Divider ratio 1:32
_WDTCPS_WDTCPS_28 EQU  H'3FFC'    ; Divider ratio 1:32
_WDTCPS_WDTCPS_29 EQU  H'3FFD'    ; Divider ratio 1:32
_WDTCPS_WDTCPS_30 EQU  H'3FFE'    ; Divider ratio 1:32
_WDTCPS_WDTCPS_31 EQU  H'3FFF'    ; Divider ratio 1:65536; software control of WDTPS

_WDTE_OFF        EQU  H'3F9F'    ; WDT Disabled, SWDTEN is ignored
_WDTE_SWDTEN     EQU  H'3FBF'    ; WDT enabled/disabled by SWDTEN bit in WDTCON0
_WDTE_NSLEEP     EQU  H'3FDF'    ; WDT enabled while sleep=0, suspended when sleep=1; SWDTEN ignored
_WDTE_ON         EQU  H'3FFF'    ; WDT enabled regardless of sleep; SWDTEN ignored

_WDTCWS_WDTCWS_0 EQU  H'38FF'    ; window delay = 87.5 percent of time; no software control; keyed access required
_WDTCWS_WDTCWS_1 EQU  H'39FF'    ; window delay = 75 percent of time; no software control; keyed access required
_WDTCWS_WDTCWS_2 EQU  H'3AFF'    ; window delay = 62.5 percent of time; no software control; keyed access required
_WDTCWS_WDTCWS_3 EQU  H'3BFF'    ; window delay = 50 percent of time; no software control; keyed access required
_WDTCWS_WDTCWS_4 EQU  H'3CFF'    ; window delay = 37.5 percent of time; no software control; keyed access required
_WDTCWS_WDTCWS_5 EQU  H'3DFF'    ; window delay = 25 percent of time; no software control; keyed access required
_WDTCWS_WDTCWS_6 EQU  H'3EFF'    ; window always open (100%); no software control; keyed access required
_WDTCWS_WDTCWS_7 EQU  H'3FFF'    ; window always open (100%); software control; keyed access not required

_WDTCCS_LFINTOSC EQU  H'7FF'    ; WDT reference clock is the 31.0kHz LFINTOSC output
_WDTCCS_HFINTOSC EQU  H'FFF'    ; WDT reference clock is the 31.25 kHz HFINTOSC
_WDTCCS_SC       EQU  H'3FFF'    ; Software Control

;----- CONFIG4 Options --------------------------------------------------
_WRT_ON          EQU  H'3FFC'    ; 0x0000 to 0x1FFF write protected
_WRT_WRT_lower   EQU  H'3FFD'    ; 0x0000 to x0FFF write protected
_WRT_WRT_upper   EQU  H'3FFE'    ; 0x0000 to 0x01FF write protected
_WRT_OFF         EQU  H'3FFF'    ; Write protection off

_SCANE_not_available EQU  H'2FFF'    ; Scanner module is not available for use
_SCANE_available EQU  H'3FFF'    ; Scanner module is available for use

_LVP_OFF         EQU  H'1FFF'    ; High Voltage on MCLR/Vpp must be used for programming
_LVP_ON          EQU  H'3FFF'    ; Low Voltage programming enabled. MCLR/Vpp pin function is MCLR.

;----- CONFIG5 Options --------------------------------------------------
_CPn_ON          EQU  H'3FFE'    ; UserNVM code protection enabled
_CPn_OFF         EQU  H'3FFF'    ; UserNVM code protection disabled

_CPDn_ON         EQU  H'3FFD'    ; DataNVM code protection enabled
_CPDn_OFF        EQU  H'3FFF'    ; DataNVM code protection disabled

;----- DEVID Equates --------------------------------------------------
_DEVID1          EQU  H'8006'

;----- IDLOC Equates --------------------------------------------------
_IDLOC0          EQU  H'8000'
_IDLOC1          EQU  H'8001'
_IDLOC2          EQU  H'8002'
_IDLOC3          EQU  H'8003'

        LIST
